eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеДоговоров/абсСогласованиеДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абсСогласованиеДоговоров</name>
  <comment>54270</comment>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникДопСогласование</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованБухгалтером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДопСогласования</name>
    <type>
      <types>EnumRef.абсСтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/Enums/абсСтатусыДоговоров/абсСтатусыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДВКУР</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеквизитовДоговора</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДСменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДИБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДирКСП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемПД</name>
  </enumValues>
  <enumValues>
    <name>ОдобрениеСДилиОСА</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФКПослеКоррректировки</name>
  </enumValues>
  <enumValues>
    <name>ОтказПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехБлоком</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАудитором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеПДМКР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДСиМТО</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехническимДиректором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеКазначейством</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДТПиР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАД</name>
  </enumValues>
  <enumValues>
    <name>ttk_ВалютныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеЦФК</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсСтатусыКонтрагентов/абсСтатусыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыКонтрагентов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>ЗавершениеОтношений</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПереутверждение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СменаРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйКонтроль</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсТипыДоговоров/абсТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсТипыДоговоров</name>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСоглашение</name>
  </enumValues>
  <enumValues>
    <name>Приложение</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОКонфиденциальности</name>
  </enumValues>
  <enumValues>
    <name>ДоговорТрехсторонний</name>
  </enumValues>
  <enumValues>
    <name>ГосударственныйКонтракт</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_ТипыСоглашенийОКонфиденциальности/абс_ТипыСоглашенийОКонфиденциальности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыСоглашенийОКонфиденциальности</name>
  <enumValues>
    <name>Типовое</name>
  </enumValues>
  <enumValues>
    <name>Нетиповое</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеИспользуется</name>
      <description>_Не используется</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодрядаНеИСП</name>
      <description>(Не исп.) Согласование договоров подряда</description>
    </items>
    <items>
      <name>Бухгалтерия</name>
      <description>Бухгалтерия</description>
    </items>
    <items>
      <name>ДФМ</name>
      <description>ДФМ</description>
    </items>
    <items>
      <name>НастройкаПрав</name>
      <description>Настройка прав</description>
    </items>
    <items>
      <name>НачислениеРНПД</name>
      <description>Начисление РНПД</description>
    </items>
    <items>
      <name>ОбщиеРоли</name>
      <description>Общие роли</description>
    </items>
    <items>
      <name>Поддержка</name>
      <description>Поддержка</description>
    </items>
    <items>
      <name>ПроектныйУчет</name>
      <description>Проектный учет</description>
    </items>
    <items>
      <name>РаботаСДоговорами</name>
      <description>Работа с договорами</description>
    </items>
    <items>
      <name>РолиИСУЗК</name>
      <description>Роли ИСУЗК</description>
    </items>
    <items>
      <name>СогласованиеАктовПриёмкиВыполненныхРабот</name>
      <description>Согласование актов приёмки выполненных работ</description>
    </items>
    <items>
      <name>СогласованиеБюджета</name>
      <description>Согласование бюджета</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодряда</name>
      <description>Согласование договоров подряда</description>
    </items>
    <items>
      <name>ЗакупочныеЗаказыСчета</name>
      <description>Согласование закупочных заказов и счетов</description>
    </items>
    <items>
      <name>СогласованиеЗаявокНаОбеспечениеТМЦ</name>
      <description>Согласование заявок на обеспечение ТМЦ</description>
    </items>
    <items>
      <name>СогласованиеОС</name>
      <description>Согласование ОС</description>
    </items>
    <items>
      <name>ttk_Аудитор</name>
      <description>Аудитор</description>
    </items>
    <items>
      <name>БюджетныйКонтролер</name>
      <description>Бюджетный контролер</description>
    </items>
    <items>
      <name>ttk_ВалютныйКонтроль</name>
      <description>Валютный контроль</description>
    </items>
    <items>
      <name>ВводКЗР</name>
      <description>Ввод КЗР</description>
    </items>
    <items>
      <name>ВводОперацияБУНУ</name>
      <description>Ввод операция БУНУ</description>
    </items>
    <items>
      <name>УстановкаСоответствияАналитикВыручки</name>
      <description>Ввод соответствий аналитик выручки</description>
    </items>
    <items>
      <name>ДирККР</name>
      <description>Дир ККР</description>
    </items>
    <items>
      <name>ДирККРвКТТК</name>
      <description>Дир ККР в КТТК</description>
    </items>
    <items>
      <name>ttk_РуководительБП</name>
      <description>Начальник бюджетного планирования</description>
    </items>
    <items>
      <name>ОтказПоАвизо</name>
      <description>Отказ по авизо</description>
    </items>
    <items>
      <name>ОткрытиеДокументаИнтеграцияСHyperion</name>
      <description>Открытие и работа с документом Интеграция с hyperion</description>
    </items>
    <items>
      <name>ОформлениеАВЗ</name>
      <description>Оформление АВЗ</description>
    </items>
    <items>
      <name>Переутверждение</name>
      <description>Переутверждение</description>
    </items>
    <items>
      <name>ПроведениеППДБезКонтроляМаппинга</name>
      <description>Проведение ППД без контроля маппинга</description>
    </items>
    <items>
      <name>РедактированиеДатыРасходаЗРС</name>
      <description>Редактирование даты расхода ЗРС</description>
    </items>
    <items>
      <name>РедактированиеППДБезКонтроляДатыЗапрета</name>
      <description>Редактирование ППД без контроля даты запрета</description>
    </items>
    <items>
      <name>ttk_РуководительДБО</name>
      <description>Руководитель департамента бюджетирования и отчетности</description>
    </items>
    <items>
      <name>РуководительДК</name>
      <description>Руководитель ДК</description>
    </items>
    <items>
      <name>РуководительПД</name>
      <description>Руководитель ПД</description>
    </items>
    <items>
      <name>СогласованиеДИБ</name>
      <description>Согласование ДИБ</description>
    </items>
    <items>
      <name>СогласованиеДРСД</name>
      <description>Согласование ДРСД</description>
    </items>
    <items>
      <name>СогласованиеДРУ</name>
      <description>Согласование ДРУ</description>
    </items>
    <items>
      <name>СогласованиеДУП</name>
      <description>Согласование ДУП</description>
    </items>
    <items>
      <name>СогласованиеДЭБ</name>
      <description>Согласование ДЭБ</description>
    </items>
    <items>
      <name>ttk_СогласованиеЗакупкиМКР</name>
      <description>Согласование Закупки МКР</description>
    </items>
    <items>
      <name>СогласованиеКонтрагентовЮристами</name>
      <description>Согласование контрагентов юристами</description>
    </items>
    <items>
      <name>СогласованиеКТТК</name>
      <description>Согласование КТТК (филиалы)</description>
    </items>
    <items>
      <name>СогласованиеПД</name>
      <description>Согласование ПД</description>
    </items>
    <items>
      <name>СогласованиеПЛ</name>
      <description>Согласование Первым лицом</description>
    </items>
    <items>
      <name>СогласованиеРекласификацииБюджетаДЭИ</name>
      <description>Согласование рекласификации бюджета (ДЭИ)</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДКП</name>
      <description>Согласование руководителя ДКП</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДОП</name>
      <description>Согласование руководителя ДОП</description>
    </items>
    <items>
      <name>СогласованиеСОКДЭБ</name>
      <description>Согласование СОК (ДЭБ)</description>
    </items>
    <items>
      <name>СогласованиеДВКУР</name>
      <description>Согласование ЦОЗД КТТК</description>
    </items>
    <items>
      <name>ttk_СогласованиеЦФК</name>
      <description>Согласование ЦФК</description>
    </items>
    <items>
      <name>СотрудникГруппыНСИ</name>
      <description>Сотрудник группы НСИ</description>
    </items>
    <items>
      <name>СотрудникДК</name>
      <description>Сотрудник ДК</description>
    </items>
    <items>
      <name>СотрудникСклада</name>
      <description>Сотрудник склада</description>
    </items>
    <items>
      <name>СуперПользователь</name>
      <description>Супер пользователь</description>
    </items>
    <items>
      <name>СуперПользовательДЗО</name>
      <description>Супер пользователь ДЗО</description>
    </items>
    <items>
      <name>ТипКонтрагентаМСФО</name>
      <description>Тип контрагента (МСФО)</description>
    </items>
    <items>
      <name>абс_ТрансфертноеЦенообразование</name>
      <description>Трансфертное ценообразование</description>
    </items>
    <items>
      <name>УстановкаПроектаСтатьи</name>
      <description>Установка проекта статьи</description>
    </items>
  </predefined>
  <attributes>
    <name>абс_РольИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеДоговоров/ObjectModule.bsl
//Перем ФормаДоговора Экспорт;

// Процедуры обработчки ИнтерактивнойАктивации
Процедура ЗаполнениеКарточкиДоговораОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.абсСогласованиеДоговоров.ТочкиМаршрута.ЗаполнениеКарточкиДоговора Тогда
		Если ДоговорКонтрагента.Пустая() Тогда
			
			ДоговорОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			ДоговорОбъект.Владелец 				= Контрагент;
			ДоговорОбъект.абс_СтатусДоговора	= Перечисления.абсСтатусыДоговоров.Подготовка;
			
			ФормаДоговора						= ДоговорОбъект.ПолучитьФорму("ФормаЭлемента");
			
			ФормаДоговора.Открыть();
			
		Иначе		
			 ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаКарточкиОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ДействиеСогласованиеБхугалтеромОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура СогласованиеДоговораОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
	
КонецПроцедуры

Процедура СогласованиеПервымЛицомОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
 
КонецПроцедуры

Процедура РегистрацияДоговораОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ДействиеСогласованиеПВПОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ДействиеОтказОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ДействиеСогласованиеДВКУРОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ДействиеПроверкаКонтрагентаОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ДействиеДополнительноеСогласованиеОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ОткрытьФормуДоговора(ДоговорКонтрагента,Задача) Экспорт
	
	Если НЕ ДоговорКонтрагента.Пустая() Тогда
		
		ФормаКонтрагента = ДоговорКонтрагента.ПолучитьФорму("ФормаЭлемента");
		
		Если ФормаКонтрагента.Открыта() Тогда
			ФормаКонтрагента.Активизировать();
		Иначе
			ФормаКонтрагента.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Старт2ПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)

	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Отказ = Истина;
		Сообщить("Не заполнен владелец договора...", СтатусСообщения.Информация);
	КонецЕсли;
КонецПроцедуры


// Обработчики ПриСозданииЗадач
Процедура СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ФормируемыеЗадачи.Очистить();	
	
	абс_БизнесПроцессы.СформироватьЗадачуСогласованиеДоговора(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, ПользовательИнициаторБП, Отказ);
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДоговорКонтрагента, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	
КонецПроцедуры

Процедура ЗаполнениеКарточкиДоговораПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ДействиеОтказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);

КонецПроцедуры

Процедура ПроверкаКарточкиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура СогласованиеДоговораПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);	
	
КонецПроцедуры

Процедура СогласованиеПервымЛицомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ДействиеСогласованиеБхугалтеромПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура РегистрацияДоговораПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	// АБС ВСТАВКА Фролов 2996
	// Сформируем задачу для Инициатора, т.к. он может на статусе Подписание и регистрация отправить договор в Отказ.
	абс_БизнесПроцессы.СформироватьЗадачуСогласованиеДоговора(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, ПользовательИнициаторБП, Отказ);
	// АБС ВСТАВКА Фролов 2996 КОНЕЦ	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ДействиеСогласованиеДВКУРПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);	
	
КонецПроцедуры

Процедура ДействиеПроверкаКонтрагентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ДействиеСогласованиеПВППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи, Отказ = Ложь)
	
	ФормируемыеЗадачи.Очистить();
	
	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямДоговоры(ЭтотОбъект.Ссылка, ТочкаМаршрута, ФормируемыеЗадачи);
	
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании задач. Не найдено ответственных.", Отказ);
		Возврат;
	КонецЕсли;
		
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДоговорКонтрагента, ТочкаМаршрута, ФормируемыеЗадачи);
	
КонецПроцедуры

// Обработчики проверки вариантов и условий
Процедура УсловиеОтправитьНаСогласованиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = НЕ ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ;
	
	//ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ ИЛИ
	//			ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД ИЛИ
	//			ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДИБ;
	
КонецПроцедуры

Процедура ВыборВарианта1ОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПроверенДФМ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДВКУР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДВКУР;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Подготовка Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантНаПодготовку;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеБухгалтерией Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеБухгалтерией;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Исполнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантИсполнение;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПодписаниеИРегистрация;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантДополнительноеСогласование;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДирКСП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДирКСП;
	//Сторчевой А.Н. D2016-1207-3107 {	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;		
	// } Сторчевой А.Н. D2016-1207-3107	
	КонецЕсли;

КонецПроцедуры

Процедура ВыборВариантаОтправитьНаСогласованиеПЛОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласование;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПервоеЛицо Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтправитьНаСогласованиеПЛ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантДополнительноеСогласование;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПВП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеПВП;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантРегистрацияДоговора;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнение;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДирКСП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДирКСП;	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДВКУР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДВКУР;	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеРуководителемПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеРуководителемПД;
	//Сторчевой А.Н. D2016-1207-3107 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ОдобрениеСДилиОСА Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОдобрениеСДилиОСА;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеАудитором Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеАудитором;
	// } Сторчевой А.Н. D2016-1207-3107
	Иначе
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
    КонецЕсли;
	
КонецПроцедуры

Процедура УсловиеСогласованиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация;
	
КонецПроцедуры

Процедура УсловиеСогласованПВППроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация
	            или ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.ОдобрениеСДилиОСА//Сторчевой А.Н. D2016-1207-3107 {;
	            или ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДирКСП;// } Сторчевой А.Н. D2016-1207-3107
КонецПроцедуры

Процедура ВыполнитьЗадачиПоТочкеБП(ТочкаМаршрутаБизнесПроцесса)
	// Выполним остальные задачи на данной точке 
	ЗапросЗадач = Новый Запрос("ВЫБРАТЬ
	                           |	абсЗадачаДоговора.Ссылка
	                           |ИЗ
	                           |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	                           |ГДЕ
	                           |	абсЗадачаДоговора.БизнесПроцесс = &БизнесПроцесс
	                           |	И абсЗадачаДоговора.ТочкаМаршрута = &ТочкаМаршрута
	                           |	И абсЗадачаДоговора.Выполнена = ЛОЖЬ");
	ЗапросЗадач.УстановитьПараметр("БизнесПроцесс", Ссылка);
	ЗапросЗадач.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрутаБизнесПроцесса);
	
	ВыборкаЗадач = ЗапросЗадач.Выполнить().Выбрать();
	
	Пока ВыборкаЗадач.Следующий() Цикл
		ЗадачаОбъект = ВыборкаЗадач.Ссылка.ПолучитьОбъект();
		
		ЗадачаОбъект.Выполнить();
	КонецЦикла;
КонецПроцедуры
            
Процедура УсловиеСогласованоБухгалтеромПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ;
КонецПроцедуры

Процедура УсловиеКонтрагентПроверенПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда  //АБС 19896
		Результат = Истина;
	Иначе
		Результат = ДоговорКонтрагента.Владелец.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Активный
		ИЛИ ДоговорКонтрагента.Владелец.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов;
	КонецЕсли;
	
КонецПроцедуры

Процедура УсловиеСогласованПЛПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация;
	
КонецПроцедуры

Процедура ВыборВариантаОтправитьНаСогласованиеОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Если ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	ИначеЕсли ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Отмена Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантАрхив;
	ИначеЕсли ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтправитьНаСогласование;
	КонецЕсли;
	
КонецПроцедуры
          
Процедура ЗавершениеДоговорСогласованИЗарегестрированПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗавершитьБП(Перечисления.абсСтатусыДоговоров.Исполнение);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ЗавершениеАрхивПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗавершитьБП(Перечисления.абсСтатусыДоговоров.Отмена);
	
КонецПроцедуры

Процедура ЗавершитьБП(СтатусЗавершения)
	
	//СторчевойА.Н. 10.11.2016 отключаем БП по ЗЗ{
	//абс_БизнесПроцессыПривелегированный.ЗавершитьБПСогласованияДоговора(ДоговорКонтрагента, СтатусЗавершения);
	абс_БизнесПроцессыПривелегированный.ПереводЗЗВСтатус(ДоговорКонтрагента, СтатусЗавершения);
	// } СторчевойА.Н. 10.11.2016
	
КонецПроцедуры

Процедура ДействиеДополнительноеСогласованиеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
		
	ФормируемыеЗадачи.Очистить();	
	
	МассивПользователей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(СотрудникДопСогласование);
	
	Если МассивПользователей.Количество() > 0 Тогда
		
		Если ЗначениеЗаполнено(МассивПользователей[0]) Тогда
			абс_БизнесПроцессы.СформироватьЗадачуСогласованиеДоговора(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, 
				МассивПользователей[0], Отказ);
		КонецЕсли;
				
	КонецЕсли;
		
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании задач на дополнительное согласование. Не найден ответственный.", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДоговорКонтрагента, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);		
	
	//СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	//
	//Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
	//	ФормируемаяЗадача.Исполнитель 	= абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(СотрудникДопСогласование);
	//	ФормируемаяЗадача.ОбъектЗадачи	= ДоговорКонтрагента;
	//	
	//	ФормируемаяЗадача.Наименование = СокрЛП(Контрагент.Наименование) + ": " + СокрЛП(ДоговорКонтрагента.Наименование) + " " 
	//		+ ФормируемаяЗадача.Наименование + ".";

	//КонецЦикла;
	//	
	
	//абс Изменение Урал 28.01.2014: Формирование одной 
	////// Добавим задачи для суперпользователей
	////абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДоговорКонтрагента, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	////++ Задача № 10549 Логинчев А.С. 21.05.2012 16:35:46
	//// АБС Фролов Д.А. 19.06.2012 Исправлено
	////АБС ВСТАВКА №000021428 Исправлено
	//СписокПользователей = абс_БизнесПроцессы.ПолучитьПользователейРоли(Справочники.РолиИсполнителей.ВозвратДоговоров_с_дополнительного_согласованияНаПД, ДоговорКонтрагента.Организация);
	////\\АБС ВСТАВКА №000021428 Исправлено
	////АБС ВСТАВКА №15941 НАЧАЛО
	//Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//					  |	Пользователи.Ссылка КАК Исполнитель
	//					  |ПОМЕСТИТЬ вр
	//					  |ИЗ
	//					  |	Справочник.Пользователи КАК Пользователи
	//					  |ГДЕ
	//					  |	Пользователи.абс_Сотрудник = &абс_Сотрудник
	//					  |	И (НЕ Пользователи.ЭтоГруппа)
	//					  |	И (НЕ Пользователи.ПометкаУдаления)
	//					  |
	//					  |ИНДЕКСИРОВАТЬ ПО
	//					  |	Исполнитель
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//					  |	РолиИИсполнители.Исполнитель
	//					  |ИЗ
	//					  |	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	//					  |ГДЕ
	//					  |	РолиИИсполнители.Исполнитель В
	//					  |			(ВЫБРАТЬ
	//					  |				вр.Исполнитель
	//					  |			ИЗ
	//					  |				вр КАК вр)
	//					  |	И РолиИИсполнители.Роль = &Роль
	//					  |	И РолиИИсполнители.Организация = &Организация
	//					  |
	//					  |СГРУППИРОВАТЬ ПО
	//					  |	РолиИИсполнители.Исполнитель
	//					  |;
	//					  |
	//					  |////////////////////////////////////////////////////////////////////////////////
	//					  |УНИЧТОЖИТЬ вр");						  
	//Запрос.УстановитьПараметр("абс_Сотрудник", ДоговорКонтрагента.абс_СотрудникДопСогласование);
	//Запрос.УстановитьПараметр("Организация",   ДоговорКонтрагента.Организация);
	//Запрос.УстановитьПараметр("Роль",          Справочники.РолиИсполнителей.СотрудникИнициаторКомпании);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СписокПользователей.Добавить(Выборка.Исполнитель);
	//КонецЦикла; 
	////АБС ВСТАВКА №15941 КОНЕЦ
	//
	//Для Каждого ТекПользовательСписка Из СписокПользователей Цикл
	//	Если НЕ ЗначениеЗаполнено(ТекПользовательСписка.Значение) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//			
	//	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//						  |	абсЗадачаДоговора.Ссылка
	//						  |ИЗ
	//						  |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	//						  |ГДЕ
	//						  |	абсЗадачаДоговора.Исполнитель = &Исполнитель
	//						  |	И (НЕ абсЗадачаДоговора.Выполнена)
	//						  |	И абсЗадачаДоговора.ОбъектЗадачи = &ОбъектЗадачи
	//						  |
	//						  |СГРУППИРОВАТЬ ПО
	//						  |	абсЗадачаДоговора.Ссылка");
	//	Запрос.УстановитьПараметр("Исполнитель",ТекПользовательСписка.Значение);
	//	Запрос.УстановитьПараметр("ОбъектЗадачи",ДоговорКонтрагента);
	//	РезультатКоличество = Запрос.Выполнить().Выгрузить().Количество();
	//	Если РезультатКоличество > 0 Тогда
	//		//по пользователю уже есть задача
	//		Продолжить;	
	//	КонецЕсли;	
	//	
	//	абс_БизнесПроцессы.СформироватьЗадачуСогласованиеДоговора(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, 
	//			ТекПользовательСписка.Значение, Отказ);
	//КонецЦикла;
	////-- Задача № 10549 Логинчев А.С.
	абс_БизнесПроцессы.СформироватьЗадачуСогласованиеДоговора(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи,, Отказ,,,Справочники.РолиИсполнителей.ВозвратДоговоров_с_дополнительного_согласованияНаПД);
	//\\абс Урал 28.01.2014
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ДействиеСогласованиеБхугалтеромПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Если ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ Тогда
		СогласованБухгалтером = Истина;
		
		Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УсловиеСоглашениеОКонфиденциальностиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_ТипДоговора = Перечисления.абсТипыДоговоров.СоглашениеОКонфиденциальности;
	
КонецПроцедуры

Процедура УсловиеДоговорЗарегестрированПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Исполнение;
	
КонецПроцедуры

Процедура УсловиеСменаИсполнителяПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД;
	
КонецПроцедуры

Процедура УсловиеТиповоеСОКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_ТипСоглашенияОКонфиденциальности = Перечисления.абс_ТипыСоглашенийОКонфиденциальности.Типовое 
		ИЛИ НЕ ЗначениеЗаполнено(ДоговорКонтрагента.абс_ТипСоглашенияОКонфиденциальности);
	
КонецПроцедуры

Процедура УсловиеСогласованДИБПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	//Сторчевой А.Н. D2016-1222-3124 { Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД;                                  
	Результат = НЕ ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ;
	// } Сторчевой А.Н. D2016-1222-3124
	
КонецПроцедуры

Процедура УсловиеСогласованДЭБПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	//Сторчевой А.Н. D2016-1222-3124 { Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДИБ;                                  
	Результат = НЕ ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ;
	// } Сторчевой А.Н. D2016-1222-3124

КонецПроцедуры

Процедура ДействиеСогласованиеДИБОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
	
КонецПроцедуры

Процедура ДействиеСогласованиеДЭБОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
	
КонецПроцедуры

Процедура ДействиеСогласованиеДИБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ДействиеСогласованиеДЭБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);

КонецПроцедуры

Процедура ВыборВариантаСогласованиеБухгалтериейОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеПД;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДВКУР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДВКУР;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласованиеБухгалтерией Тогда
	//Сторчевой А.Н. D2016-1207-3107 { 
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеЗакупкиМКР;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда	
	// } Сторчевой А.Н. D2016-1207-3107
		Результат = ТочкаВыбораВарианта.Варианты.ДополнительноеСогласование;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;
	//Сторчевой А.Н. D2016-1207-3107 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДЭБ;
	// } Сторчевой А.Н. D2016-1207-3107
	//Сторчевой А.Н. D2017-0517-3373 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеКазначейством Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеКазначейством;
	// } Сторчевой А.Н. D2017-0517-3373
	//Сторчевой А.Н. 77163404 23.08.2017 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеАД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеАД;
	// } Сторчевой А.Н. 77163404 23.08.2017
    КонецЕсли;	
	
КонецПроцедуры   

Процедура ДействиеУточнениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);

	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);	
	
КонецПроцедуры

Процедура ДействиеУточнениеОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		
		Организация = ДоговорКонтрагента.Организация;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДействиеДополнительноеСогласованиеОФКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
			
	ФормируемыеЗадачи.Очистить();	
	
	МассивПользователей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(СотрудникДопСогласование);
	
	Если МассивПользователей.Количество() > 0 Тогда
		
		Если ЗначениеЗаполнено(МассивПользователей[0]) Тогда
			абс_БизнесПроцессы.СформироватьЗадачуСогласованиеДоговора(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, 
				МассивПользователей[0], Отказ);
		КонецЕсли;
				
	КонецЕсли;
		
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании задач на дополнительное согласование. Не найден ответственный.", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДоговорКонтрагента, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);		
	
	//СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	//
	//Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
	//	ФормируемаяЗадача.Исполнитель 	= абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(СотрудникДопСогласование);
	//	ФормируемаяЗадача.ОбъектЗадачи	= ДоговорКонтрагента;
	//	
	//	ФормируемаяЗадача.Наименование = СокрЛП(Контрагент.Наименование) + ": " + СокрЛП(ДоговорКонтрагента.Наименование) + " " 
	//		+ ФормируемаяЗадача.Наименование + ".";

	//КонецЦикла;
	//	
	//// Добавим задачи для суперпользователей
	//абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДоговорКонтрагента, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	

	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ДействиеДополнительноеСогласованиеОФКОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура УсловиеНаОтказИзОФКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ;
	
КонецПроцедуры

Процедура ОтказСогласованияДоговораПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ;

КонецПроцедуры

Процедура ДополнительноеСогласованиеБухгалтеромОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
	
КонецПроцедуры

Процедура ДополнительноеСогласованиеБухгалтеромПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	//Сторчевой А.Н. D2016-1207-3107 {
	//ФормируемыеЗадачи.Очистить();	
	//
	//Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента.абс_СотрудникДопСогласование) Тогда
	//	ttk_ОбщегоНазначения.СообщитьОбОшибке("Не выбран сотрудник доп. согласования.", Отказ);
	//КонецЕсли;
	//
	//ПользователиДопСогласования = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(СотрудникДопСогласование);
	//
	//Если ПользователиДопСогласования.Количество() = 0 Тогда
	//	ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найден пользователь доп. согласования.", Отказ);
	//КонецЕсли;
	//
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;	
	//
	//ПользовательДопСогласования = ПользователиДопСогласования[0];
	//
	//абс_БизнесПроцессы.СформироватьЗадачуСогласованиеДоговора(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, ПользовательДопСогласования, Отказ);
	//
	//абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	// } Сторчевой А.Н. DD2016-1207-3107

КонецПроцедуры

Процедура ДействиеСогласованиеДирКСПОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
	
КонецПроцедуры

Процедура ДействиеСогласованиеДирКСППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ВыборВарианта2ОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДоговораПД;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ПроверкаКарточки;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;
	//Сторчевой А.Н. D2016-1207-3107 {	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ОдобрениеСДилиОСА Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОдобрениеСДилиОСА;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Подписание_и_регистрация;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДополнительноеСогласование;	
	// } Сторчевой А.Н. D2016-1207-3107	
	Иначе
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
    КонецЕсли;

КонецПроцедуры

Процедура ВыборВариантаВозвратаОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДирКСП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДирКСП;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДоговораПД;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Подготовка Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Подготовка;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДВКУР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДВАиК;		
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеРуководителемПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеРуководителемПД;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ОдобрениеСДилиОСА Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОдобрениеСДилиОСА;		
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДопСогласование;			
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеБухгалтерией Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеБухгалтерией;
	//Сторчевой А.Н. D2016-1207-3107 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеТехБлоком Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеТехБлоком;
	//Сторчевой А.Н. D2017-0517-3373 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеДСиМТО Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДСиМТО;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеТехническимДиректором Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеТехническимДиректором;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеКазначейством Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеКазначейством;
	// } Сторчевой А.Н. D2017-0517-3373
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ПроверкаКарточки;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПВП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеПВП;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДЭБ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеАудитором Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеАудитором;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласованиеБухгалтерией Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеЗакупкиМКР;
	// } Сторчевой А.Н. D2016-1207-3107
	//Сторчевой А.Н. 77150592 31.07.2017 {                                   
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеДТПиР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДТПиР;
	// } Сторчевой А.Н. 77150592 31.07.2017
	//Сторчевой А.Н. 77163404 23.08.2017 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеАД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеАД;
	// } Сторчевой А.Н. 77163404 23.08.2017
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыборСледующегоСтатусаОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеПД;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДополнительноеСогласование;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантРегистрацияДоговора;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПВП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеПВП;	
	//Сторчевой А.Н. D2016-1207-3107 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДЭБ;
	// } Сторчевой А.Н. D2016-1207-3107
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;
	//Сторчевой А.Н. D2017-0517-3373 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеКазначейством Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеКазначейством;
	// } Сторчевой А.Н. D2017-0517-3373
	//Сторчевой А.Н. 77163404 23.08.2017 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеАД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеАД;
	// } Сторчевой А.Н. 77163404 23.08.2017
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыборСледующегоСтатусаДопСогласованияОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеПД;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДВКУР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДВКУР;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеРуководителемПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеРуководителемПД;	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ОдобрениеСДилиОСА Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОдобрениеСДилиОСА;		
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;
	//Сторчевой А.Н. D2016-1207-3107 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеТехБлоком Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеТехБлоком;
	//Сторчевой А.Н. D2017-0517-3373 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеДСиМТО Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДСиМТО;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеТехническимДиректором Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеТехническимДиректором;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеКазначейством Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеКазначейством;
	// } Сторчевой А.Н. D2017-0517-3373
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеБухгалтерией Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеБухгалтерией;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПВП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеПВП;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДирКСП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДирКСП;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДЭБ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеАудитором Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеАудитором;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласованиеБухгалтерией Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеЗакупкиМКР;
	// } Сторчевой А.Н. D2016-1207-3107
	//Сторчевой А.Н. 77120188 19.06.2017 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеОФК;
	// } Сторчевой А.Н. 77120188 19.06.2017
	//Сторчевой А.Н. 77150592 31.07.2017 {                                   
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеДТПиР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДТПиР;
	// } Сторчевой А.Н. 77150592 31.07.2017
	//Сторчевой А.Н. 77163404 23.08.2017 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеАД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеАД;
	// } Сторчевой А.Н. 77163404 23.08.2017
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействиеСогласованиеРуководителемПДОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
	
КонецПроцедуры

Процедура ДействиеСогласованиеРуководителемПДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);                                               	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ВыборВариантаСогласованияРуководителемПДОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДВКУР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДВАиК;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДополнительноеСогласование;
	//Сторчевой А.Н. D2016-1207-3107 {	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДирКСП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДирКСП;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПВП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеПВП;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ОдобрениеСДилиОСА Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОдобрениеСДилиОСА;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Подписание_и_регистрация;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеАудитором Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеАудитором;
	// } Сторчевой А.Н. D2016-1207-3107
	КонецЕсли;

КонецПроцедуры

Процедура ДействиеОдобрениеСДилиОСАОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
	
КонецПроцедуры

Процедура ДействиеОдобрениеСДилиОСАПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ВыборОдобрениеСДилиОСАОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Подписание_и_регистрация;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДополнительноеСогласование;			
	КонецЕсли;
	            	
КонецПроцедуры

Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.ОдобрениеСДилиОСА;    	
	
КонецПроцедуры

//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
Процедура ПроеркаОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отмена Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отмена;
	Иначе
		Результат = ТочкаВыбораВарианта.Варианты.ПродолжитьСогласование;
	КонецЕсли;	
	
КонецПроцедуры
//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов

//Проектный учет Родин
Процедура НеобходимоСогласованиеРуководителемБлокаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеРуководителемБлока;    	
КонецПроцедуры

Процедура СогласованиоРуководителемБлокаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ;    	
КонецПроцедуры

Процедура СогласованиеРуководителемБлокаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	абс_БизнесПроцессы.СформироватьЗадачиДляРуководителейБлока(Ссылка,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи,ДоговорКонтрагента.абс_НаправлениеДеятельности,Отказ);	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
КонецПроцедуры
//Проектный учет Родин

//Сторчевой А.Н. D2016-1222-3124 {
Процедура НеобходимоСогласованиеТехБлокомПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = (СокрЛП(ДоговорКонтрагента.Организация.Наименование) = "КТТК" и не ДоговорКонтрагента.абс_Конфиденциальный и не ДоговорКонтрагента.абс_ТипДоговора = Перечисления.абсТипыДоговоров.СоглашениеОКонфиденциальности);    	
КонецПроцедуры

Процедура СогласованиеТехБлокомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);

КонецПроцедуры

Процедура СогласованиеТехБлокомОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры
// } Сторчевой А.Н. D2016-1222-3124

//Сторчевой А.Н. D2016-1207-3107 {
Процедура УсловиеСогласованиеДирКСППроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДирКСП;
КонецПроцедуры

Процедура ВыборВариантаСогласованияТехБлокомОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ПроверкаКарточки;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДополнительноеСогласование;	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;
	//Сторчевой А.Н. D2017-0517-3373 {
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеДСиМТО Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДСиМТО;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеТехническимДиректором Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеТехническимДиректором;
	// } Сторчевой А.Н. D2017-0517-3373
	//Сторчевой А.Н. 77150592 31.07.2017 {                                   
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеДТПиР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДТПиР;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДоговораПД;
	// } Сторчевой А.Н. 77150592 31.07.2017
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборВариантаСогласованияВПОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПодписаниеИРегистрация;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ОдобрениеСДилиОСА Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОдобрениеСДилиОСА;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДирКСП Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДирКСП;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДополнительноеСогласование;	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборВариантаДЭБОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорКонтрагента.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДИБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДИБ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДоговораПД;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеПДМКР Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДоговораПД;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ДополнительноеСогласование Тогда	
		Результат = ТочкаВыбораВарианта.Варианты.ДополнительноеСогласование;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.Уточнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Уточнение;
	//Сторчевой А.Н. 77150592 31.07.2017 {	
	ИначеЕсли ТекСтатусДоговора = Перечисления.абсСтатусыДоговоров.ttk_СогласованиеТехническимДиректором Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеТехническимДиректором;
	// } Сторчевой А.Н. 77150592 31.07.2017	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействиеСогласованиеАудиторомОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ДействиеСогласованиеАудиторомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);	

КонецПроцедуры
// } Сторчевой А.Н. D2016-1207-3107

//Сторчевой А.Н. 77122555 31.05.2017 {                                   
Процедура УсловиеОтменаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Отмена;
КонецПроцедуры
// } Сторчевой А.Н. 77122555 31.05.2017

//Сторчевой А.Н. D2017-0517-3373 {
Процедура СогласованиеИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);
КонецПроцедуры

Процедура СогласованиеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
КонецПроцедуры
// } Сторчевой А.Н. D2017-0517-3373
